<?php
$students = [
    [
        "имя" => "Алия",
        "возраст" => 20,
        "предметы" => [
            ["название" => "Математика", "оценка" => 90],
            ["название" => "Физика", "оценка" => 85],
            ["название" => "Английский", "оценка" => 95]
        ]
    ],
    [
        "имя" => "Ерасыл",
        "возраст" => 21,
        "предметы" => [
            ["название" => "Информатика", "оценка" => 88],
            ["название" => "История", "оценка" => 79],
            ["название" => "Физика", "оценка" => 91]
        ]
    ]
];

// Вывод информации о студентах
foreach ($students as $student) {
    echo "Имя: " . $student["имя"] . "\n";
    echo "Возраст: " . $student["возраст"] . "\n";
    echo "Предметы:\n";
    foreach ($student["предметы"] as $subject) {
        echo "- " . $subject["название"] . ": " . $subject["оценка"] . "\n";
    }
    echo "---------------------\n";
}
?>
