<?php
$products = [
    [
        "название" => "Ноутбук",
        "цена" => 350000,
        "количество" => 12
    ],
    [
        "название" => "Смартфон",
        "цена" => 250000,
        "количество" => 30
    ],
    [
        "название" => "Наушники",
        "цена" => 19990,
        "количество" => 50
    ]
];

// Вывод информации о продуктах
foreach ($products as $product) {
    echo "Название: " . $product["название"] . "\n";
    echo "Цена: " . $product["цена"] . " тг\n";
    echo "Количество на складе: " . $product["количество"] . "\n";
    echo "---------------------\n";
}
?>
